<html>

<head>
  <title>ЕГЭ информатика задание №15 Python</title>
  <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.2.0-beta1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-0evHe/X+R7YkIZDRvuzKMRqM+OrBnVFBL6DOitfPri4tjfHxaWutUpFmBp4vmVor" crossorigin="anonymous">
  <link href="prism.css" rel="stylesheet" />
  <script src="prism.js"></script>
  <style>
    .page-item { width: 150% }
  </style>
</head>
<body class="line-numbers">
<ul class="pagination">
  <li class="page-item"><a class="page-link" style="background-color: #bdff6f; color:  #0d6efd" href="tips.html">Советы</a></li>
  <li class="page-item"><a class="page-link disabled">1</a></li>
  <li class="page-item"><a class="page-link " href="ege-2.html">2</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">3</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">4</a></li>
  <li class="page-item"><a class="page-link " href="ege-5.html">5</a></li>
  <li class="page-item"><a class="page-link" href="ege-6.html">6</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">7</a></li>
  <li class="page-item"><a class="page-link " href="ege-8.html">8</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">9</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">10</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">11</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">12</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">13</a></li>
  <li class="page-item"><a class="page-link " href="ege-14.html">14</a></li>
  <li class="page-item"><a class="page-link active" href="ege-15.html">15</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">16</a></li>
  <li class="page-item"><a class="page-link " href="ege-17.html">17</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">18</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">19</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">20</a></li>
  <li class="page-item"><a class="page-link disabled" href="#">21</a></li>
  <li class="page-item"><a class="page-link" href="ege-22.html">22</a></li>
  <li class="page-item"><a class="page-link " href="ege-23.html">23</a></li>
  <li class="page-item"><a class="page-link " href="ege-24.html">24</a></li>
  <li class="page-item"><a class="page-link " href="ege-25.html">25</a></li>
  <li class="page-item"><a class="page-link " href="ege-26.html">26</a></li>
  <li class="page-item"><a class="page-link " href="ege-27.html">27</a></li>
</ul>
<h2 style="text-align: center">№15</h2>
  <div class="d-flex justify-content-center mt-5 p-2 m-2 shadow rounded">
  <div class="row">
    <div class="col-lg-6 col-sm-4">
      <table style="border: 2px solid #358ccb">
        <tr><td>
          <b>Для какого наименьшего целого неотрицательного числа A выражение<br>(3m + 4n > 63) ∨ ((m ≤ A) ∧ (n < A))<br>тождественно истинно при любых целых неотрицательных m и n?</b><br>
          <i>Источник: <a href="https://inf-ege.sdamgia.ru/problem?id=18630">ссылка</a></i>
        <tr><td>
      </table><br>
      <p>"Условие истинно при любых m и n" означает, что оно истинно при всех. Попытаемся найти такие m и n, при которых это выражение станет ложным. Если такая ситуация произошла, делаем <code>flag</code> ложным. Тут цикл можно прервать. В конце проверяем: если пробежав все m и n у нас <code>flag</code> остался истинным, значит эта <code>А</code> подходит "при любых m и n".</p>
      <i>Всё условие берём в скобки!<br>Вы можете написать отдельные условия на проверку <code>flag</code> для каждого цикла, но это не имеет смысла, потому что, даже выполнив все циклы, программа завершиться быстрее, чем вы будете писать их.</i>
    </div>
    <div class="col-lg-6 col-sm-4">
      <pre><code class="language-python">#Последовательно перебираем все переменные
#"целого неотрицательного числа A" значит
#перебор от 0 (ОБРАЩАЙТЕ НА ЭТО ВНИМАНИЕ!)
for A in range(300):
    flag = True
    for m in range(300):
        for n in range(300):
            if not((3*m + 4*n > 63) or ((m <= A) and (n < A))):
                flag = False #Делаем флаг ложным
                break #Можно остановить этот цикл
    #Если мы пробежали все m и n и при этом flag ни разу не стал
    #ложным, значит этот A нам подходит
    if flag:
        print(A)
        break #Так как нам нужен "наименьший A", значит,
        #можно остановить цикл тут
</code></pre>
    </div>
  </div>
</div>

</body>
</html>
